Revit 2027 API
AnnotationLabelParameterFormatting.LeadingSpaces Property
 The number of spaces to add before the parameter value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int LeadingSpaces { get; }
Public ReadOnly Property LeadingSpaces As Integer
	Get
public:
property int LeadingSpaces {
	int get ();
}
member LeadingSpaces : int with get
Property Value
Int32
See Also
Reference
AnnotationLabelParameterFormatting Class
Autodesk.Revit.DB Namespace